WolfBoy55014/RP2040-Scheduler/src/scheduler.c
// Called from the HardFault_Handler trampoline in context.s with a pointer to the
// hardware-stacked exception frame: {R0, R1, R2, R3, R12, LR, PC, xPSR}.
//
// ARMv6-M (Cortex-M0/M0+, used on the RP2040) has no CFSR/HFSR/BFAR fault status
// registers, so this stacked frame is the *only* ground-truth information the CPU
// gives us about a fault. In particular:
//   - frame[6] (PC)  is the address of the instruction that was executing/faulted.
//   - frame[5] (LR)  is the return address of the function that PC was in
//                    (i.e. who called it), recovered directly from hardware,
//                    not guessed by a debugger's stack unwinder.
// Anything an IDE's "Call Stack" view shows *beyond* these two values is
// heuristic frame-pointer walking and can easily wander into uninitialized/
// filler stack memory once it runs out of real unwind info - so don't trust
// it past this point. Use `arm-none-eabi-addr2line -e <elf> <pc>` (and same
// for lr) to map these addresses back to real source lines.
__attribute__((noinline))
void hard_fault_handler_c(uint32_t* fault_stack) {
    const uint32_t r0  = fault_stack[0];
    const uint32_t r1  = fault_stack[1];
    const uint32_t r2  = fault_stack[2];
    const uint32_t r3  = fault_stack[3];
    const uint32_t r12 = fault_stack[4];
    const uint32_t lr  = fault_stack[5];
    const uint32_t pc  = fault_stack[6];
    const uint32_t psr = fault_stack[7];

    uint32_t task_id = 0xFFFFFFFF;
    void* task_stack_base = NULL;
    void* task_stack_top = NULL;
    if (scheduler_is_started()) {
        task_t* current_task = get_current_task();
        if (current_task) {
            task_id = current_task->id;
            task_stack_base = current_task->stack_base;
            task_stack_top = current_task->stack;
        }
    }

    printf("\n\n!!! HARD FAULT on core %u !!!\n", CORE_NUM);
    printf("  Running task id: %lu\n", task_id);
    printf("  PC : 0x%08lx  <-- faulting instruction (use addr2line on this)\n", pc);
    printf("  LR : 0x%08lx  <-- caller of the faulting function\n", lr);
    printf("  PSR: 0x%08lx\n", psr);
    printf("  R0 : 0x%08lx   R1 : 0x%08lx   R2 : 0x%08lx   R3 : 0x%08lx\n", r0, r1, r2, r3);
    printf("  R12: 0x%08lx\n", r12);
    if (task_stack_base) {
        printf("  Task stack: top=%p base=%p faulted_sp=%p\n",
               task_stack_top, task_stack_base, (void*)fault_stack);
    }
    printf("!!! Anything below this in an IDE call-stack view past PC/LR above\n");
    printf("!!! is heuristic unwinding and may not be trustworthy.\n\n");

#if DUMP_STACKS
    heap_dump();
#endif
#if STATUS_LED
    gpio_init(STATUS_LED_PIN);
    gpio_set_dir(STATUS_LED_PIN, GPIO_OUT);
    gpio_put(STATUS_LED_PIN, false);
    busy_wait_ms(250);
    gpio_put(STATUS_LED_PIN, true);
    busy_wait_ms(250);
    gpio_put(STATUS_LED_PIN, false);
#endif
    asm("bkpt");
}


void refresh_systick_on_clock_change() {
    const uint32_t clock_hz = clock_get_hz(clk_sys);
    const uint32_t ticks = (clock_hz * LOOP_TIME) / 1000;

    // set when the timer should fire based on new clock speed
    systick_hw->rvr = ticks - 1;

    // reset systick to zero
    systick_hw->cvr = 0;
}

void refresh_systick_all_cores() {
    // update the systick on this core
    refresh_systick_on_clock_change();

#if CORE_COUNT > 1
    // signal the other core to do the same
    multicore_fifo_push_blocking(MULTICORE_SIG_UPDATE_SYSTICK);

    // wait for a response from the other core
    multicore_fifo_pop_blocking();
#endif
}

#if CORE_COUNT > 1
void check_multicore_signals() {
    if (multicore_fifo_rvalid()) {
        uint32_t cmd = multicore_fifo_pop_blocking();

        if (cmd == MULTICORE_SIG_UPDATE_SYSTICK) {
            refresh_systick_on_clock_change();
            // acknowledge
            multicore_fifo_push_blocking(MULTICORE_SIG_ACKNOWLEDGE);
        }
    }
}
#endif

void scheduler_raise_pendsv() {
    *(volatile uint32_t*)(0xe0000000 | M0PLUS_ICSR_OFFSET) = (1L << 28);
}

__attribute__((noinline))
void SysTick_Handler(void) {
#if PROFILE_SCHEDULER
    profile.ran_channel_collection = false;
    profile.ran_schedular_collection = false;
    profile.ran_cpu_usage = false;
    profile.ran_governor = false;
    profile.ran_stack_resize = false;
    profile.ran_stack_usage = false;

    profile.start_us = time_us_64();
#endif

#if CORE_COUNT > 1
    // read and handle signals from other core
    check_multicore_signals();
#endif

    scheduler_t* scheduler = get_scheduler();
#if !CPU_FANCY_USAGE_MONITORING
    scheduler->ticks_executing++;
    task_t* task = get_current_task();

    if (task->id < CORE_COUNT) {
        scheduler->ticks_idling++;
    }

    task->ticks_executing++;
#endif

    if (CORE_NUM == 0) {
        if ((scheduler->ticks_since_start % STACK_MONITOR_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_stack_usage = true;
#endif
            calculate_stack_usage();
        }
        if ((scheduler->ticks_since_start % CHANNEL_GARBAGE_COLLECT_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_channel_collection = true;
#endif
            channel_garbage_collect();
        }
        if ((scheduler->ticks_since_start % CPU_USAGE_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_cpu_usage = true;
#endif
            calculate_cpu_usage();
        }
        if ((scheduler->ticks_since_start % SCHEDULER_GARBAGE_COLLECT_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_schedular_collection = true;
#endif
            scheduler_garbage_collect();
        }
#if USE_GOVERNOR
        if ((scheduler->ticks_since_start % GOVERNOR_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_governor = true;
#endif
            governor_update();
        }
#endif
    }

#if PROFILE_SCHEDULER
    profile.end_us = time_us_64();

    printf("\ntime: %llu, su: %u, sr: %u, sc: %u, cc: %u, cu: %u, cg: %u\n", profile.end_us - profile.start_us,
           profile.ran_stack_usage, profile.ran_stack_resize, profile.ran_schedular_collection,
           profile.ran_channel_collection, profile.ran_cpu_usage, profile.ran_governor);
#endif

    scheduler->ticks_since_start++;

    // raise PendSV interrupt (handler in assembly!)
    scheduler_raise_pendsv();
}

