WolfBoy55014/RP2040-Scheduler/src/scheduler.c
/* Task Functions */

void task_sleep_ms(uint32_t ms) {
    if (ms > (UINT32_MAX / 1000)) {
        task_sleep_us(UINT32_MAX);
        return;
    }

    task_sleep_us(ms * 1000);
}

void task_sleep_us(uint64_t us) {
    if (us == 0) {
        task_yield();
        return;
    }

    const uint32_t saved_irq = scheduler_spin_lock();
    task_t* current_task = get_current_task();
    current_task->state = TASK_WAIT_US;
    current_task->resume_us = make_timeout_time_us(us);
    scheduler_spin_unlock(saved_irq);
    scheduler_raise_pendsv();
}

void task_yield() {
    const uint32_t saved_irq = scheduler_spin_lock();
    task_t* current_task = get_current_task();
    current_task->state = TASK_YIELDING;
    scheduler_spin_unlock(saved_irq);
    scheduler_raise_pendsv();
}

kelp_error_t task_request_stack(uint32_t stack_size) {
#if DYNAMIC_STACK
    const uint32_t saved_irq = scheduler_spin_lock();
    task_t* current_task = get_current_task();
    current_task->state = TASK_STACK_OVERFLOWED;
    current_task->requested_stack_size = stack_size;
    scheduler_spin_unlock(saved_irq);
    scheduler_raise_pendsv();

    if (current_task->stack_size == stack_size) {
        return KELP_OK;
    }
#endif
    return KELP_ERROR;
}

kelp_error_t task_stack_fit_buffer(const uint32_t headroom, const uint32_t buffer_bytes, const bool shrink) {
#if DYNAMIC_STACK
    // convert bytes to 32-bit words, rounding up
    const uint32_t buffer_words = (buffer_bytes + 3) / 4;
    // headroom for all other locals and call frames
    const uint32_t needed_words = buffer_words + headroom + STACK_OVERFLOW_THRESHOLD;

    if (!shrink) {
        // skip if stack is already big enough
        task_t* current_task = get_current_task();
        uint32_t current_stack_size = current_task->stack_size;
        if (current_stack_size >= needed_words) {
            return KELP_OK;
        }
    }

    if (needed_words > MAX_STACK_SIZE) {
        return KELP_MEMORY;
    }

    return task_request_stack(needed_words);
#else
    return KELP_ERROR;
#endif
}

void task_end(int32_t code) {
    task_return();
}

bool task_exists_no_lock(uint32_t pid) {
    for (uint32_t i = 0; i < MAX_TASKS; i++) {
        if (tasks[i].id == pid && tasks[i].state != TASK_FREE) {
            return true; // id exists
        }
    }

    return false;
}

bool task_exists(uint32_t pid) {
    const uint32_t saved_irq = scheduler_spin_lock();

    bool exists = task_exists_no_lock(pid);

    scheduler_spin_unlock(saved_irq);
    return exists;
}

void task_signal(uint32_t pid, uint32_t signals) {
    task_t* task = NULL;

    const uint32_t saved_irq = scheduler_spin_lock();
    for (uint32_t i = 0; i < MAX_TASKS; i++) {
        if (tasks[i].id == pid && tasks[i].state != TASK_FREE) {
            task = &tasks[i];
            break;
        }
    }

    if (task == NULL) {
        scheduler_spin_unlock(saved_irq);
        return;
    }

    task->signals |= signals;

    scheduler_spin_unlock(saved_irq);
}
